#+TITLE:Formatted I/O: scanf
#+AUTHOR:Marcus Birkenkrahe
#+Source: KN King C Programming
#+SUBTITLE:CSC 100 Introduction to programming in C/C++
#+STARTUP:overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes :includes <stdio.h>
#+PROPERTY: header-args:C :exports both :comments both
* Overview

  * A ~scanf~ format string may contain ordinary characters and
    conversion specifications like ~d~, ~e~, ~f~, ~g~

  * The conversions allowed with ~scanf~ are essentially the same as
    those used with ~printf~

  * The ~scanf~ format string tends to contain only conversion specs

  * [ ] What will this sample input assign to the variables in [[tscanf]]
    below? *Write down* what you think the output will be before
    running it. These sample data are already stored in the input file.

    #+begin_example
      1  -20  .3   -4.0e3
    #+end_example

    #+name: tscanf
    #+begin_src C :cmdline < io_scanf_input :results output
      int i, j;
      float x, y;

      scanf("%d%d%f%f", &i, &j, &x, &y);

      printf("|%5d|%5d|%5.1f|%5.1f|\n", i, j, x, y);
    #+end_src

    #+RESULTS: tscanf
    : |    1|  -20|  0.3|-4000.0|

* Ordinary characters in format strings

  * ~scanf~ reads white-space until it reaches a symbol

  * When it reaches a symbol, it tries to match to next input

  * It now either continues processing or aborts

  * Example:

    If the format string is ~"%d/%d"~ and the input is ~•5/•96~,
    ~scanf~ succeeds.

    If the input is ~•5•/•96~ , ~scanf~ fails, because the ~/~ in the
    format string doesn’t match the space in the input.

  * To allow spaces after the first number, use ~"%d /%d"~ instead

  * [X] Let's try it. Run the block [[ordTest]] first with two input files:
    - the input file ~ord1~ contains ~•5/•96~ and should succeed
    - the input file ~ord2~ contains ~•5 /•96~ and should fail

    To use different input files, you need to change ~ord1~ in the code
    block header to ~ord2~.

    #+name: ordTest
    #+begin_src C :cmdline < ord2
      int i,j;

      scanf("%d/%d", &i, &j);

      printf("|%5d|%5d|\n", i, j);
    #+end_src

    #+RESULTS: ordTest
    |   | 5 | 67 |

   
  * [ ] Next, fix the ~scanf~ format string below to allow input from
    ~ord2~ and run the file to see if it worked.

    #+name: ordTest1
    #+begin_src C :cmdline < ord2
      int i,j;

      scanf("%d /%d    ", &i, &j);

      printf("|%5d|%5d|\n", i, j);
    #+end_src

    #+RESULTS: ordTest1
    |   | 5 | 96 |

* Get coding: sample program

  * The [[addfrac]] program prompts the user to add two fractions and then
    display their sum.

    Sample output:
    #+begin_example
      Enter first fraction: 5/6
      Enter second fraction: 3/4
      The sum is 38/24
    #+end_example

  * [ ] Complete the format strings below so that the program runs as
    intended! The sample input is already stored in the
    ~addfrac_input~ file in the format shown.

    #+begin_src C :cmdline < addfrac_input :results output
      int num1, denom1, num2, denom2, result_num, result_denom;

      printf("Enter first fraction: ");
      scanf("%d/%d", &num1, &denom1);

      printf("Enter second fraction: ");
      scanf("%d/%d", &num2, &denom2);

      result_num = num1 * denom2 + num2 *denom1;
      result_denom = denom1 * denom2;

      printf("\nThe sum is %d divided by %d\n",result_num, result_denom);
    #+end_src

    #+RESULTS:
    : Enter first fraction: Enter second fraction: 
    : The sum is 38 divided by 24

